---
kind: property
id: P:Autodesk.Revit.DB.ReferencePointArray.Item(System.Int32)
source: html/75dc0ee7-6f2f-2fb0-807a-c1d42d3b6c19.htm
---
# Autodesk.Revit.DB.ReferencePointArray.Item Property

Gets or sets a reference at a specified index within the array.

## Syntax (C#)
```csharp
public virtual ReferencePoint this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the reference to be set or retrieved.

## Returns
Returns the reference at the specified index.